# zish macOS bootstrap package list.
# Install with: brew bundle --file ./Brewfile

# CLI tools
brew "bat"
brew "btop"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "htop"
brew "jq"
brew "lazygit"
brew "mise"
brew "neovim"
brew "nvm"
brew "pnpm"
brew "ripgrep"
brew "rust"
brew "tmux"
brew "tree-sitter-cli"
brew "uv"
brew "worktrunk"
brew "yq"
brew "zoxide"
brew "dust"

# Apps
cask "1password"
cask "audacity"
cask "bruno"
cask "clash-verge-rev"
cask "codex"
cask "contexts"
cask "feishu"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "iina"
cask "input-source-pro"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "keka"
cask "macshot"
cask "mole-app"
cask "mos"
cask "neteasemusic"
cask "obsidian"
cask "orbstack"
cask "raycast"
cask "shortcat"
cask "slack"
cask "stats"
cask "tencent-meeting"
cask "telegram"
cask "typora"
cask "visual-studio-code"
cask "wechat"
cask "wetype"
cask "zed"
cask "zotero"
